In [1]:
import pymysql
import pandas as pd

In [ ]:
#Connect to mysql database through pymysql
conn = pymysql.connect(database = 'di_automobile', user = 'pymytest', password = 'nepal')

In [ ]:
try:
    cursor = conn.cursor()                                
    sqlStatement = "CREATE DATABASE DI_Automobile;"
    cursor.execute(sqlStatement)
except Exception as e:
    print("Exeception occured:{}".format(e))
finally:
    conn.close()

In [ ]:
#insert into the database and commit.
try:
    cursor = conn.cursor()                                
    #sqlQuery = "CREATE TABLE myCars(indexID int, Company varchar(30), bodystyle varchar(30),wheelbase decimal(10,2),length decimal(10,2),enginetype varchar(30),numofcylinders varchar(20),horsepower int,averagemileage int,price int);"
    sqlQuery = """INSERT INTO mycars VALUES  (2,'alfa-romero','hatchback',88.6,168.8,'dohc','six',111,21,16500)"""
    cursor.execute(sqlQuery)
    conn.commit()
except Exception as e:
    print("Exeception occured:{}".format(e))
finally:
    conn.close()

In [2]:
conn = pymysql.connect(database = 'sakila', user = 'pymytest', password = 'nepal')

In [3]:
cursor = conn.cursor()

In [4]:
# Set SQL query as a comment
sql_query = ''' SELECT * FROM film '''
df = pd.read_sql(sql_query, conn)

df['title']

0       ACADEMY DINOSAUR
1         ACE GOLDFINGER
2       ADAPTATION HOLES
3       AFFAIR PREJUDICE
4            AFRICAN EGG
             ...
995       YOUNG LANGUAGE
996           YOUTH KICK
997         ZHIVAGO CORE
998    ZOOLANDER FICTION
999            ZORRO ARK
Name: title, Length: 1000, dtype: object

In [5]:
sql_query1 = ''' SELECT f.title, a.first_name, a.last_name FROM film_actor as fa join film as f on fa.film_id = f.film_id join actor as a on a.actor_id = fa.film_id'''
df1 = pd.read_sql(sql_query1, conn)

In [ ]:
df1